Revit 2024 API
TableSectionData.AllowOverrideCellStyle Method
 Identifies if the style can be overridden in the given cell.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool AllowOverrideCellStyle(
	int nRow,
	int nCol
)
Visual Basic
Public Function AllowOverrideCellStyle ( _
	nRow As Integer, _
	nCol As Integer _
) As Boolean
Visual C++
public:
bool AllowOverrideCellStyle(
	int nRow,
	int nCol
)
Parameters
nRow
Type: System.Int32
nCol
Type: System.Int32
Return Value
 True if allow to override cell style.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given row number nRow is invalid. -or- The given column number nCol is invalid.
See Also
TableSectionData Class
Autodesk.Revit.DB Namespace